{
  "_name_or_path": "hustvl/yolos-small",
  "architectures": [
    "YolosForObjectDetection"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_loss": false,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 384,
  "id2label": {
    "0": "LABEL_0"
  },
  "image_size": [
    512,
    864
  ],
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "model_type": "yolos",
  "num_attention_heads": 6,
  "num_channels": 3,
  "num_detection_tokens": 100,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "use_mid_position_embeddings": true
}
